; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	thermograph0 - mode
	spectrograph3 - mode
	spectrograph4 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation1 - direction
	GroundStation5 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(pointing satellite1 Star7)
	(pointing satellite3 Phenomenon13)
	(have_image Phenomenon6 spectrograph3)
	(have_image Star7 thermograph0)
	(have_image Planet8 spectrograph3)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 thermograph0)
	(have_image Planet11 image1)
	(have_image Phenomenon12 spectrograph3)
	(have_image Phenomenon13 spectrograph4)
	(have_image Star14 thermograph2)
	(have_image Phenomenon15 thermograph2)
))

)

; plan
1. (turn_to satellite2 groundstation4 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite2 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite2 star7 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star7)
   goals met: 0 of 12
5. (take_image satellite2 star7 instrument3 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 1 of 12
6. (turn_to satellite2 planet10 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet10)
   goals met: 1 of 12
7. (take_image satellite2 planet10 instrument3 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 12
9. (turn_to satellite1 star7 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star7)
   goals met: 3 of 12
10. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 12
11. (take_image satellite2 phenomenon9 instrument3 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 4 of 12
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 12
13. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 4 of 12
14. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 4 of 12
15. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 4 of 12
16. (turn_to satellite0 phenomenon12 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 12
17. (take_image satellite0 phenomenon12 instrument1 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 5 of 12
18. (turn_to satellite0 phenomenon6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 12
19. (take_image satellite0 phenomenon6 instrument1 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 6 of 12
20. (turn_to satellite0 planet11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet11)
   goals met: 6 of 12
21. (take_image satellite0 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 7 of 12
22. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 7 of 12
23. (take_image satellite0 planet8 instrument1 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 8 of 12
24. (turn_to satellite2 groundstation4 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation4)
   goals met: 8 of 12
25. (calibrate satellite2 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 8 of 12
26. (turn_to satellite2 phenomenon13 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon13)
   goals met: 8 of 12
27. (take_image satellite2 phenomenon13 instrument4 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 9 of 12
28. (turn_to satellite2 phenomenon15 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon15)
   goals met: 9 of 12
29. (take_image satellite2 phenomenon15 instrument4 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 10 of 12
30. (turn_to satellite2 star14 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 star14)
   goals met: 10 of 12
31. (take_image satellite2 star14 instrument4 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 11 of 12
32. (turn_to satellite3 phenomenon13 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon13)
   goals met: 12 of 12
